app/Controllers/ReportController.php

    public function laporkan()
    {
        // Ambil data JSON yang dikirim oleh client
        $request = \Config\Services::request();
        $data = $request->getJSON(true); // Mengambil data sebagai array

        // Log data yang diterima
        log_message('debug', print_r($data, true)); // Untuk memeriksa apa yang diterima

        // Pastikan data yang diperlukan ada
        if (isset($data['image_id'], $data['violation_status'], $data['description'], $data['user_name'])) {
            $imageId = $data['image_id'];
            $violationStatus = $data['violation_status'];
            $description = $data['description'];
            $userName = $data['user_name'];

            // Persiapkan data untuk disimpan
            $reportData = [
                'image_id' => $imageId,
                'violation_status' => $violationStatus,
                'description' => $description,
                'user_name' => $userName, // Tambahkan user_name ke data yang disimpan
                'created_at' => date('Y-m-d H:i:s'), // Waktu saat laporan dibuat
            ];

            // Load model pelaporan
            $reportModel = new ReportModel();

            // Simpan laporan ke dalam database
            if ($reportModel->save($reportData)) {
---
INSERT INTO `reports` (`image_id`, `violation_status`, `description`, `user_name`, `created_at`) VALUES ('2024-12-03_10-26-44_esp32-cam.jpg', 'Peringatan nih! Ada aktivitas dalam kegiatan kuliah pagi di parkiran, jangan bilang itu kamu yang telat!', 'Esp32 cam', '2202006', '2024-12-03 03:27:59')

    public function index()
    {
        $reportModel = new ReportModel(); // Instantiate the ReportModel
        // Corrected line: directly use $reportModel without extra $
        $data['pelaporan'] = $reportModel->findAll(); // Get all data from the model
---
SELECT *
FROM `reports`